# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\bhatt\Documents\PSoC Creator\MotorTests\ArmDriver.cydsn\ArmDriver.cyprj
# Date: Mon, 16 Apr 2018 01:32:02 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {UART_SCBCLK(FFB)} -period 666.66666666666663 -waveform {0 333.333333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock(FFB)} -period 2083.333333333333 -waveform {0 1041.66666666667} [list [get_pins {ClockBlock/ff_div_8}] [get_pins {ClockBlock/ff_div_9}] [get_pins {ClockBlock/ff_div_10}] [get_pins {ClockBlock/ff_div_11}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 33} [list]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 51 99} -nominal_period 2083.333333333333 [list]


# Component constraints for C:\Users\bhatt\Documents\PSoC Creator\MotorTests\ArmDriver.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\bhatt\Documents\PSoC Creator\MotorTests\ArmDriver.cydsn\ArmDriver.cyprj
# Date: Mon, 16 Apr 2018 01:31:58 GMT
